Revit 2027 API
AnalyticalDistributionNodePropertyData.ConnectedPhases Property
 The electrical connected phases of the electrical analytical node to its upstream node.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElectricalConnectedPhases ConnectedPhases { get; }
Public ReadOnly Property ConnectedPhases As ElectricalConnectedPhases
	Get
public:
property ElectricalConnectedPhases ConnectedPhases {
	ElectricalConnectedPhases get ();
}
member ConnectedPhases : ElectricalConnectedPhases with get
Property Value
ElectricalConnectedPhases
Remarks
 For ATS, the upstream node is "Supply From 2" if it has only set "Supply From 2", otherwise, "Supply From 1". Will return a default value if no upstream node.
See Also
Reference
AnalyticalDistributionNodePropertyData Class
Autodesk.Revit.DB.Electrical Namespace